
# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "heroku/brew"
tap "gromgit/fuse"

# Apps
brew "mas"
cask "setapp"

# Communications
cask "signal"
cask "superhuman"
cask "skype"
cask "microsoft-teams"
cask "discord"
cask "muzzle"

# Encryption & Secrets
brew "gnupg"
brew "pinentry-mac"
cask "1password"
cask "1password-cli"
cask "viscosity"
cask "tresorit"
cask "gpg-suite"
brew "macfuse"

# Browsing
cask "brave-browser"
cask "google-drive"
cask "google-chrome"
cask "transmission"

# Development
brew "jemalloc" # M1-en mukodik?
brew "gh"
cask "iterm2"
cask "fork"
cask "visual-studio-code"
cask "vscodium"
cask "docker"
brew "heroku"
brew "pwgen"
brew "ruby-build", args: ["HEAD"]
brew "rbenv"

# Entertainment
cask "spotify"
cask "vlc"
cask "subler"
cask "tidal"

# App Store stuff
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Bear", id: 1091189122
mas "CloudApp", id: 417602904
mas "Craft", id: 1487937127
mas "Cryptowatch Desktop", id: 1527457231
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Divvy", id: 413857545
mas "GoodNotes", id: 1444383602
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "LanScan", id: 472226235
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "OmniPlan", id: 1040002810
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Things", id: 904280696
mas "Transmit", id: 1436522307
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "VMWare Remote Console", id: 1230249825
